content/post/my-essentials.md
+++
title = "My Essentials"
author = ["Rafael Nicdao"]
tags = ["misc"]
draft = false
date = 2021-11-27
pin = true
summary = "Things that I deem essential in everyday life"
+++

## Technology {#technology}


### Software {#software}

| Category         | Choice        | Notes                                                                                                                                       |
|------------------|---------------|---------------------------------------------------------------------------------------------------------------------------------------------|
| Operating System | Manjaro       | Best of both worlds: bleeding edge packages + it just works!                                                                                |
| Window Manager   | i3            | At this point, I feel like non-tiling WMs just slow me down.                                                                                |
| Terminal         | Alacritty     | Works nicely for Emacs via TTY.                                                                                                             |
| Text Editor      | Emacs         | Emacs Lisp makes it easy to customize most things. Sure, it's not the snappiest editor out there but that's a tradeoff I'm willing to take. |
| Database GUI     | Dbeaver       | I've tried a bunch of others like Beekeeper, PGAdmin, Emacs (ejc-sql) but they all lack an important feature or two.                        |
| Web Browser      | Google Chrome | I would move to Chromium or Firefox if they supported true sandboxed profiles. I like to keep my different work/personal profiles separate. |


### Hardware {#hardware}

TODO
